src/Enums/ЕдиницыИзмеренияВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ЕдиницыИзмеренияВремени</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Час</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ЕдиницыИзмеренияВремени/Ext/ManagerModule.bsl
Функция ПолучитьСрокХраненияВСекундах(СрокХраненияТовара, ЕдиницаИзмеренияСрокаХранения) Экспорт
	
	Результат = 0;
	
	Если ЕдиницаИзмеренияСрокаХранения = Перечисления.ЕдиницыИзмеренияВремени.Час Тогда
		Результат = СрокХраненияТовара*3600;
	ИначеЕсли ЕдиницаИзмеренияСрокаХранения = Перечисления.ЕдиницыИзмеренияВремени.День Тогда
		Результат = СрокХраненияТовара*86400;
	ИначеЕсли ЕдиницаИзмеренияСрокаХранения = Перечисления.ЕдиницыИзмеренияВремени.Неделя Тогда
		Результат = СрокХраненияТовара*7*86400;
	ИначеЕсли ЕдиницаИзмеренияСрокаХранения = Перечисления.ЕдиницыИзмеренияВремени.Месяц Тогда
		Результат = СрокХраненияТовара*30*86400;
	ИначеЕсли ЕдиницаИзмеренияСрокаХранения = Перечисления.ЕдиницыИзмеренияВремени.Год Тогда
		Результат = СрокХраненияТовара*365*86400;
	Иначе
		Результат = СрокХраненияТовара*86400;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
